     A**********************************************************************    
     A          R RCALMAP                   PFILE(CALMAP)                       
     A          K CALWRKC                                                       
     A          K CALCODE                                                       