     A                                      REF(SAMREF)
     A          R FARTI
     A            ARID      R
     A            ARDESC    R
     A            ARSALEPR  R               REFFLD(UNITPRICE)
     A                                      TEXT('REF SALE PRICE')
     A                                      COLHDG('REF' 'SALE' 'PRICE')
     A                                      EDTCDE(2)
     A            ARWHSPR   R               REFFLD(UNITPRICE)
     A                                      TEXT('STOCK PRICE')
     A                                      COLHDG('STOCK' 'PRICE')
     A                                      EDTCDE(2)
     A            ARTIFA    R               REFFLD(FAID)
     A            ARSTOCK   R               REFFLD(QUANTITY)
     A                                      TEXT('STOCK')
     A                                      COLHDG('STOCK')
     A                                      EDTCDE(2)
     A            ARMINQTY  R               REFFLD(QUANTITY)
     A                                      TEXT('MINIMUM STOCK')
     A                                      COLHDG('MINIMUM' 'STOCK')
     A                                      EDTCDE(2)
     A            ARCUSQTY  R               REFFLD(QUANTITY)
     A                                      TEXT('CUSTOMER ORDER QUANTITY')
     A                                      COLHDG('CUSTOMER' 'ORDER' 'QTY')
     A            ARPURQTY  R               REFFLD(QUANTITY)
     A                                      TEXT('PURCHASE ORDER QUANTITY')
     A                                      COLHDG('PRUCHASE' 'ORDER' 'QTY')
     A                                      EDTCDE(2)
     A            ARVATCD   R               REFFLD(VATCODE)
     A            ARCREA          L         TEXT('CREATION DATE')
     A                                      COLHDG('CREAETION' 'DATE')
     A            ARMOD           Z         TEXT('LAST MODIFICATION')
     A                                      COLHDG('LAST' 'MODIFICATION')
     A            ARMODID       10          TEXT('LAS MOD BY')
     A                                      COLHDG('LAST' 'MODIF.' 'BY')
     A            ARDEL     R               REFFLD(DLCODE)
     A            ALIAS         10          TEXT('RESERVED')
     A            #TEMP         10          TEXT('RESERVED')